<a href="https://colab.research.google.com/github/valdenio458/livro-python-para-analise-de-dados/blob/main/capitulo_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# Limpeza e preparação dos dados

### 7.1 Tratando dados ausentes

In [ ]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [ ]:
string_data

In [ ]:
string_data.isnull()

Filtrando dados ausentes

In [ ]:
from numpy import nan as NA

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
data

In [ ]:
data.dropna()

In [ ]:
# dropna() é equivalente a notnull()
data[data.notnull()]

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

In [ ]:
cleaned

In [ ]:
# Passar how='all' descartará apenas as linhas que contenham somente NAs:
data.dropna(how='all')

In [ ]:
# cria uma coluna só com NAs
data[4] = NA

In [ ]:
data

In [ ]:
# Para descartar colunas que só contenham NAs, passe axis=1, how='all
data.dropna(axis=1, how='all')

Preenchendo dados ausentes

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))

In [ ]:
df

In [ ]:
df.iloc[:4, 1] = NA

In [ ]:
df.iloc[:2, 2] = NA

In [ ]:
df

In [ ]:
# Chamar fillna com uma constante como argumento, substitui valores ausentes por esse valor
df.fillna(0)

In [ ]:
# Ao chamar fillna com um dicionário, podemos usar um valor de preenchimento
# diferente para cada coluna
df.fillna({1: 0.5, 2: 2.})

In [ ]:
# fillna devolve um novo objeto. Para alterar o objeto existente use o argumento
# inplace
df.fillna(5., inplace=True)

In [ ]:
df

### 7.2 Transformação de dados

Removendo duplicatas

In [ ]:
data = pd.DataFrame({'k1' : ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [ ]:
data

In [ ]:
# O método 'duplicated' devolve uma Series boolena informando se cada linha
# é uma duplicata ou não
data.duplicated()

In [ ]:
# 'drop_duplicates' devolve um DataFrame com dados em que o array 'duplicated' é False
data.drop_duplicates()

In [ ]:
# Adicionando uma nova coluna ao DataFrame
data['v1'] = range(7)
data

In [ ]:
# Filtrando as duplicatas somente com base na coluna 'k1'

In [ ]:
data.drop_duplicates('k1')

In [ ]:
# 'duplicated' e 'drop_duplicates', por padrão, mantém a primeira combinação
# de valores observada. Passar keep='last' devolverá a última
data.drop_duplicates(['k1','k2'], keep='last')

In [ ]:
pd.__version__

Transformando dados usando uma função ou um mapeamento

In [2]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [3]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [5]:
# Converter todos os valores da coluna 'food' para minúsculas
lowercased = data['food'].str.lower()

In [6]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [7]:
# Cria uma nova coluna 'animal' e usa a função 'map' para preenchê-la
data['animal'] = lowercased.map(meat_to_animal)

In [8]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Substituindo valores

In [9]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [10]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [11]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [12]:
# Para substituir diversos valores de uma só vez, passe uma lista e, em seguida,
# o valor para substituição
data.replace([-999., -1000.], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [13]:
# Para usar um substituto diferente para cada valor, passe uma lista deles
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [14]:
# O argumento especificado também pode ser um dicionário
data.replace({-999 : np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Renomeando os índices dos eixos

In [2]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                                          index=['Ohio','Colorado','New York'],
                                          columns=['one', 'two', 'three','four'])

In [3]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [7]:
# Como em uma Series, os índices de um eixo têm um método map
transform = lambda x: x[:4].upper()

In [8]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [9]:
# Fazendo uma atribuição para index, modificando o DataFrame in-place
data.index = data.index.map(transform)

In [10]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [11]:
# Criando uma versão transformada de um conjunto de dados sem modificar
# os dados originais, usando o método rename
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
# rename pode ser usado em conjunto com um objeto do tipo dicionário
# fornecendo novos valores para um subconjunto dos rótulos de um eixo
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

Detectando e filtrando valores discrepantes (outliers)

In [12]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [13]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005093     0.004121    -0.011714     0.059055
std       0.988135     0.976090     1.000706     1.001323
min      -2.642299    -2.958013    -3.470505    -3.727952
25%      -0.626052    -0.673135    -0.658934    -0.616302
50%      -0.043288    -0.019315    -0.000895     0.061766
75%       0.613007     0.623322     0.647235     0.681301
max       2.850797     4.204945     3.343076     3.071273

In [15]:
col = data[2]

In [16]:
# Encontrar valores que excedam 3 em vazlor absoluto em uma das colunas
col[np.abs(col) > 3]

527   -3.470505
548    3.336425
640    3.225556
649    3.343076
692    3.082195
783   -3.009070
Name: 2, dtype: float64

In [19]:
# Para selecionar todas as linhas que tenham um valor que exceda 3 ou -3, podemos utilizar o método 'any' em um Dataframe booleano
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
131  1.266697  3.054822  0.597020  1.275691
202  0.360405  4.204945  0.829689  0.327825
303  0.204540  3.264588 -0.297599  1.812237
453  1.045194 -1.842603  0.914444 -3.727952
527 -0.194007 -0.009471 -3.470505  1.243285
548  1.543058  0.816427  3.336425  2.388838
640 -1.465530 -0.227620  3.225556  2.157495
649  1.208400  0.672355  3.343076 -0.206660
674 -1.154927  3.594533  0.235206 -1.873834
692  0.504350 -0.681221  3.082195  0.485657
776  0.518829  3.342450  0.620190  0.746216
783  0.182526 -0.913048 -3.009070  1.324936
976 -1.366401  0.267740  0.948200  3.071273

### 7.3 Manipulação de strings

Métodos de objetos string

In [20]:
# Uma string separada por vírgulas pode ser dividida em partes usando 'split'
val = 'a, b,  guido'

In [21]:
val.split(',')

['a', ' b', '  guido']

In [22]:
# Com frequência, 'split' é usado em conjunto com 'strip' para remover
# espaços em branco (incluindo quebras de linha)
pieces = [x.strip() for x in val.split(',')]

In [23]:
pieces

['a', 'b', 'guido']

In [24]:
# Métodos de localização de substrings
'guido' in val

True

In [ ]:
# Métodos de localização de substrings
val.index(',')

In [ ]:
# Métodos de localização de substrings
val.find(':')

In [ ]:
# A diferença entre 'find' e 'index' é que 'index' lança uma exceção caso
# a substring não seja encontrada
val.index(':')

In [ ]:
# Devolve o número de de ocorrências de uma substring em particular
val.count(',')